module.exports = {
    commands: {
        charname: {
            no_permission: "У вас нет необходимых прав для использования этой команды.",
            invalid_target: "Неверная цель!",
            dm_initial: "Привет, я хотел бы узнать имя твоего основного персонажа. Пожалуйста, ответь именем своего основного персонажа.",
            dm_failed: "Не удалось отправить личное сообщение пользователю {username}.",
            dm_sent: "Я спросил у пользователя имя его персонажа.",
            empty_response: "Ответ не может быть пустым. Пожалуйста, предоставьте действительный ответ.",
            nickname_success: "Имя вашего основного персонажа успешно изменено на {nickname}.",
            nickname_failed: "Не удалось изменить имя вашего основного персонажа из-за: {error}"
        },
        language: {
            no_permission: "У вас нет необходимых прав для использования этой команды.",
            success: "✅ Язык сервера установлен на {language}."
        }
    },
    events: {
        guildMemberAdd: {
            blacklisted: "Вы были занесены в черный список гильдии. Если вы считаете, что это ошибка, пожалуйста, свяжитесь с администрацией гильдии или подайте апелляцию на https://discord.gg/YDqBQU43Ht",
            charname_ask: "Привет, я хотел бы узнать имя твоего основного персонажа.\nПожалуйста, ответь именем своего основного персонажа для сервера.\n\n(Твой ответ не будет сохранен приложением и используется только для никнейма в гильдии)",
            invalid_response: "Ваш ответ не может быть пустым или слишком длинным.\nПожалуйста, предоставьте действительный ответ.",
            name_changed: "Ваше имя успешно изменено на {nickname} для гильдии {guildName}.",
            name_change_failed: "Не удалось изменить ваше имя: {error}",
            timeout: "Время вышло! Свяжитесь с администратором сервера, если хотите снова изменить свое имя.",
            mod_notification: "Не удалось отправить запрос на имя персонажа пользователю {username}. Вероятно, у них отключены личные сообщения.",
            welcome_title: "Добро пожаловать в {guildName}!",
            welcome_message: "Добро пожаловать, {member}, на наш сервер!\n\nЕсли у вас есть вопросы, не стесняйтесь задавать их в публичном канале."
        }
    }
};
